app/views/concerts_utilisateur/show.html.erb

<p>
	<% if @seance = Seance.find_by(concert_id: @concert.id) %>
---
SELECT  "seances".* FROM "seances" WHERE "seances"."concert_id" = ? LIMIT ?  [["concert_id", 1], ["LIMIT", 1]]


		<%=	Artiste.find( @seance.artiste_id).nom %>
---
SELECT  "artistes".* FROM "artistes" WHERE "artistes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]


		<p><%= User.find(s.user_id).username %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]