app/views/artistes/show.html.erb

SELECT "seances".* FROM "seances" WHERE "seances"."artiste_id" = ?  [["artiste_id", 2]]
---

<% seances = Seance.where(artiste_id: @artiste.id) %>

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% seances.each do |s| %>
	<% concert  = Concert.find(s.concert_id) %>