app/views/users/mes_reservations.html.erb


	<% place = Place.find(r.place_id) %>
	<% concert =  Concert.find(place.concert_id) %>
	<% seance = Seance.find(place.seance_id) %>
	<% artiste = Artiste.find(seance.artiste_id) %>
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "seances".* FROM "seances" WHERE "seances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "artistes".* FROM "artistes" WHERE "artistes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]