app/controllers/artistes_controller.rb

  def create
	@artistes = Artiste.all
	@artiste = Artiste.new(artiste_params)
	@artiste.save
---
INSERT INTO "artistes" ("nom") VALUES (?)  [["nom", "JayZ"]]

  def edit
	@artiste = Artiste.find(params[:id])
---
SELECT  "artistes".* FROM "artistes" WHERE "artistes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@artiste = Artiste.find(params[:id])

		if @artiste.update(artiste_params)
---
SELECT  "artistes".* FROM "artistes" WHERE "artistes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "artistes" SET "nom" = ? WHERE "artistes"."id" = ?  [["nom", "Garouuu"], ["id", 1]]

  def show
	@artiste = Artiste.find(params[:id])
---
SELECT  "artistes".* FROM "artistes" WHERE "artistes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy
		@artiste = Artiste.find(params[:id])
		@artiste.destroy
---
SELECT  "artistes".* FROM "artistes" WHERE "artistes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artistes" WHERE "artistes"."id" = ?  [["id", 3]]