app/controllers/commentaires_controller.rb

    def create
        @commentaire = Commentaire.new(commentaires_params)
        @commentaire.save
---
INSERT INTO "commentaires" ("texte", "titre", "concert_id", "user_id") VALUES (?, ?, ?, ?)  [["texte", "Super!"], ["titre", "Stade de France"], ["concert_id", 2], ["user_id", 2]]