app/controllers/concerts_utilisateur_controller.rb

SELECT "concerts".* FROM "concerts"
SELECT "genres".* FROM "genres"
SELECT "artistes".* FROM "artistes"
---
  def index
  	@concerts = Concert.all
	@genres = Genre.all
	@artistes = Artiste.all

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "places".* FROM "places" WHERE "places"."concert_id" = ? LIMIT ?  [["concert_id", 21], ["LIMIT", 1]]
SELECT "concerts".* FROM "concerts"
SELECT "genres".* FROM "genres"
SELECT "typesplaces".* FROM "typesplaces"
SELECT  "seances".* FROM "seances" WHERE "seances"."concert_id" = ? LIMIT ?  [["concert_id", 1], ["LIMIT", 1]]
SELECT "artistes".* FROM "artistes"
SELECT "commentaires".* FROM "commentaires" WHERE "commentaires"."concert_id" = ?  [["concert_id", 1]]
---
  def show
	  	@concert = Concert.find(params[:id])
		@places = Place.all
		@concerts = Concert.all
		@genres = Genre.all
		@typesplaces = Typesplace.all
		@seances = Seance.all
		@artistes = Artiste.all
        @commentaires = Commentaire.where(concert_id: params[:id])