app/controllers/concerts_controller.rb

	def index
		@concerts = Concert.all
		@genres = Genre.all
		@typesplaces = Typesplace.all
		@artistes = Artiste.all
		@places = Place.all
		@seances = Seance.all
		@reservations = Reservation.all
---
SELECT "concerts".* FROM "concerts"
SELECT "genres".* FROM "genres"
SELECT "places".* FROM "places"
SELECT "typesplaces".* FROM "typesplaces"
SELECT "artistes".* FROM "artistes"
SELECT "seances".* FROM "seances"
SELECT "reservations".* FROM "reservations"

	def new
		@concert = Concert.new
		@genres = Genre.all
---
SELECT "genres".* FROM "genres"

	def show
	  	@concert = Concert.find(params[:id])
		@place = Place.find_by(concert_id: @concert.id)
		if @place
			@typesplace = Typesplace.find(@place.typesplace_id)
			@seance = Seance.find(@place.seance_id)
			@artiste = Artiste.find(@seance.artiste_id)
		end
		@genre = Genre.find(@concert.genre_id)
		@seances = Seance.all
		@typesplaces = Typesplace.all
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "places".* FROM "places" WHERE "places"."concert_id" = ? LIMIT ?  [["concert_id", 1], ["LIMIT", 1]]
SELECT  "typesplaces".* FROM "typesplaces" WHERE "typesplaces"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "seances".* FROM "seances" WHERE "seances"."concert_id" = ? LIMIT ?  [["concert_id", 1], ["LIMIT", 1]]
SELECT  "artistes".* FROM "artistes" WHERE "artistes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "seances".* FROM "seances"
SELECT "places".* FROM "places"
SELECT "typesplaces".* FROM "typesplaces"

	def edit
		@concert = Concert.find(params[:id])
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@concert = Concert.new(concert_params)
		@concert.save
---
INSERT INTO "concerts" ("name", "genre_id") VALUES (?, ?)  [["name", "uo"], ["genre_id", 1]]

	def update
		@concert = Concert.find(params[:id])

		if @concert.update(concert_params)
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "concerts" SET "name" = ?, "genre_id" = ? WHERE "concerts"."id" = ?  [["name", "taratata"], ["genre_id", 3], ["id", 10]]

	def destroy
		@concert = Concert.find(params[:id])
		@concert.destroy
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "concerts" WHERE "concerts"."id" = ?  [["id", 15]]