app/controllers/concerts_controller.rb

	def show
		@concert = Concert.find(params[:id])
		@places = Place.all
		@genres = Genre.all
---
SELECT "genres".* FROM "genres"

	def edit
		@concert = Concert.find(params[:id])
		@genres = Genre.all
---
SELECT "genres".* FROM "genres"

	def create
		@genres = Genre.all
---
SELECT  "genres".* FROM "genres" WHERE "genres"."concert_id" = ? LIMIT ?  [["concert_id", 12], ["LIMIT", 1]]