app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
	@genres = Genre.all

INSERT INTO "genres" ("nom") VALUES (?)  [["nom", "RNB"]]
---
  def create
	@genres = Genre.all
	@genre = Genre.new(genre_params)
	@genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "nom" = ? WHERE "genres"."id" = ?  [["nom", "Soule"], ["id", 1]]
---
	def update
		@genre = Genre.find(params[:id])

		if @genre.update(genre_params)

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
	@genre = Genre.find(params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 4]]
---
	def destroy
		@genre = Genre.find(params[:id])
		@genre.destroy