app/controllers/places_controller.rb

SELECT "concerts".* FROM "concerts"
SELECT "typesplaces".* FROM "typesplaces"
---
  def new
	@places = Place.all
	@place = Place.new
	@concerts = Concert.all
	@typesplaces = Typesplace.all

INSERT INTO "places" ("places", "prix", "concert_id", "typesplace_id", "nombre_max_places", "seance_id") VALUES (?, ?, ?, ?, ?, ?)  [["places", 90], ["prix", 56], ["concert_id", 1], ["typesplace_id", 2], ["nombre_max_places", 90], ["seance_id", 10]]
---
  def create
	@places = Place.all
	@concerts = Concert.all
	@typesplaces = Typesplace.all
	@place = Place.new(place_params)
	@place.save

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
	@place = Place.find(params[:id])

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "places" SET "places" = ?, "prix" = ? WHERE "places"."id" = ?  [["places", 10], ["prix", 2], ["id", 4]]
---
	def update
		@place = Place.find(params[:id])

		if @place.update(place_params)

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
	@place = Place.find(params[:id])

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "places" WHERE "places"."id" = ?  [["id", 1]]
---
	def destroy
		@place = Place.find(params[:id])
		@place.destroy