app/controllers/reservations_controller.rb

  def new
	@places = Reservation.all
---
SELECT "reservations".* FROM "reservations"