app/controllers/reservations_controller.rb

  def index
	@places = Place.all
	@typeplaces = Typesplace.all
	@reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def new
	@places = Place.all
	@reservation = Reservation.new
	@concerts = Concert.all
	@typesplaces = Typesplace.all
---
SELECT "places".* FROM "places"
SELECT "concerts".* FROM "concerts"
SELECT "typesplaces".* FROM "typesplaces"

  def create
	@reservation = Reservation.new(reservation_params)
	@user= User.find(current_user.id)
    if @reservation.save
		@place = Place.find(@reservation.place_id)
		unless @reservation.nombre_reservations > @place.places
			@place.places -= @reservation.nombre_reservations
			@place.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "reservations" ("place_id", "nombre_reservations", "user_id") VALUES (?, ?, ?)  [["place_id", 10], ["nombre_reservations", 1], ["user_id", 4]]
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "places" SET "places" = ? WHERE "places"."id" = ?  [["places", 397], ["id", 10]]

  def show
	@reservation = Reservation.find(params[:id])

	@place = Place.find(@reservation.place_id)
	@seance = Seance.find(@place.seance_id)
	@artiste = Artiste.find(@seance.artiste_id)
	@concert = Concert.find(@place.concert_id)
	@genre = Genre.find(@concert.genre_id)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "seances".* FROM "seances" WHERE "seances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "artistes".* FROM "artistes" WHERE "artistes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy
		@reservation = Reservation.find(params[:id])
		@reservation.destroy
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 3]]