app/controllers/salles_controller.rb

  def create
    @salle = Salle.new(salle_params)
    if @salle.save
---
INSERT INTO "salles" ("nom", "adresse") VALUES (?, ?)  [["nom", "Bataclan"], ["adresse", " 50 Boulevard Voltaire, 75011 Paris"]]

  def show
    @salle = Salle.find(params[:id])
---
SELECT  "salles".* FROM "salles" WHERE "salles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]