app/controllers/seances_controller.rb

  def index
	@seances = Seance.all
---
SELECT "seances".* FROM "seances"

  def new
	@seances = Seance.all
	@seance = Seance.new
	@concerts = Concert.all
	@artistes = Artiste.all
    @salles = Salle.all
---
SELECT "seances".* FROM "seances"
SELECT "concerts".* FROM "concerts"
SELECT "artistes".* FROM "artistes"
SELECT "salles".* FROM "salles"

  def create
	@seance = Seance.new(seance_params)
	@seance.save
---
INSERT INTO "seances" ("date", "concert_id", "artiste_id") VALUES (?, ?, ?)  [["date", Sun, 18 Dec 2016], ["concert_id", 1], ["artiste_id", 2]]

  def edit
	@seance = Seance.find(params[:id])
---
SELECT  "seances".* FROM "seances" WHERE "seances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
	@seance = Seance.find(params[:id])
	@seances = Seance.all
	@concerts = Concert.all
	@artistes = Artiste.all
---
SELECT  "seances".* FROM "seances" WHERE "seances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "seances".* FROM "seances"
SELECT "concerts".* FROM "concerts"
SELECT "artistes".* FROM "artistes"

	def destroy
		@seance = Seance.find(params[:id])
		@seance.destroy
---
SELECT  "seances".* FROM "seances" WHERE "seances"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "seances" WHERE "seances"."id" = ?  [["id", 2]]