app/controllers/searchs_controller.rb

SELECT "artistes".* FROM "artistes" WHERE "artistes"."nom" = ?  [["nom", "admin"]]
SELECT "concerts".* FROM "concerts" WHERE "concerts"."name" = ?  [["name", "admin"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "admin"]]
---
    def new
        @param = params[:q]
        @artiste = Artiste.where(nom: @param)
        @concert = Concert.where(name: @param)
        @user = User.where(username: @param)