app/controllers/typesplaces_controller.rb

  def new
	@typesplaces = Typesplace.all
---
SELECT "typesplaces".* FROM "typesplaces"

  def create
	@typesplaces = Typesplace.all
	@typesplace = Typesplace.new(typesplace_params)
	@typesplace.save
---
INSERT INTO "typesplaces" ("nom") VALUES (?)  [["nom", "Tribunes"]]

  def edit
	@typesplace = Typesplace.find(params[:id])
---
SELECT  "typesplaces".* FROM "typesplaces" WHERE "typesplaces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		@typesplace = Typesplace.find(params[:id])

		if @typesplace.update(typesplace_params)
---
SELECT  "typesplaces".* FROM "typesplaces" WHERE "typesplaces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "typesplaces" SET "nom" = ? WHERE "typesplaces"."id" = ?  [["nom", "V.I.P0"], ["id", 1]]

  def show
	@typesplace = Typesplace.find(params[:id])
---
SELECT  "typesplaces".* FROM "typesplaces" WHERE "typesplaces"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def destroy
		@typesplace = Typesplace.find(params[:id])
		@typesplace.destroy
---
SELECT  "typesplaces".* FROM "typesplaces" WHERE "typesplaces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "typesplaces" WHERE "typesplaces"."id" = ?  [["id", 1]]