app/controllers/users_controller.rb

  def mes_reservations
    @reservations = Reservation.where(user_id: current_user.id)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 4]]

  def create
    @user = User.new(user_params)
    @user.isadmin = 0
    @user.username = @user.username.capitalize
    @user.firstname = @user.firstname.capitalize
    @user.lastname = @user.lastname.capitalize

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "crypted_password", "salt", "created_at", "updated_at", "username", "lastname", "firstname", "isadmin") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["salt", "hyPYHZEeeaRq9wq9UUJw"], ["crypted_password", "$2a$10$99LJ6EsA1b.OZsliBxgUfuHm9KRtTY6WnTosH9uVUVbnpIJZFvgla"], ["updated_at", 2016-11-21 21:25:10 UTC], ["id", 7]]